In [2]:
import pandas as pd
import numpy as np
df = pd.read_csv('credit_scoring_eng.csv')
df['education'] = df.education.str.title()
df = pd.read_csv('credit_scoring_eng.csv')

In [5]:
def filna_by_other_colum(df, target_colum, column_to_replace, agg = 'mean'):
    grouped = df.groupby(column_to_replace).agg({target_colum: ['mean','median']})

    for index in grouped.index:
        df.loc[df[target_colum].isna() & (df[column_to_replace] == index), target_colum] = grouped.loc[index,(target_colum, agg)]

    return df
df = filna_by_other_colum(df, 'days_employed', 'education', agg = 'mean')
df = filna_by_other_colum(df,'total_income', 'education', agg = 'mean') 
df.isna().sum()

children            0
days_employed       0
dob_years           0
education           0
education_id        0
family_status       0
family_status_id    0
gender              0
income_type         0
debt                0
total_income        0
purpose             0
dtype: int64

In [6]:
print(df)

       children  days_employed  dob_years            education  education_id  \
0             1   -8437.673028         42    Bachelor'S Degree             0
1             1   -4024.803754         36  Secondary Education             1
2             0   -5623.422610         33  Secondary Education             1
3             3   -4124.747207         32  Secondary Education             1
4             0  340266.072047         53  Secondary Education             1
...         ...            ...        ...                  ...           ...
21520         1   -4529.316663         43  Secondary Education             1
21521         0  343937.404131         67  Secondary Education             1
21522         1   -2113.346888         38  Secondary Education             1
21523         3   -3112.481705         38  Secondary Education             1
21524         2   -1984.507589         40  Secondary Education             1

           family_status  family_status_id gender income_type  debt  \
0                married                 0      F    employee     0
1                married                 0      F    employee     0
2                married                 0      M    employee     0
3                married                 0      M    employee     0
4      civil partnership                 1      F     retiree     0
...                  ...               ...    ...         ...   ...
21520  civil partnership                 1      F    business     0
21521            married                 0      F     retiree     0
21522  civil partnership                 1      M    employee     1
21523            married                 0      M    employee     1
21524            married                 0      F    employee     0

       total_income                  purpose
0         40620.102    purchase of the house
1         17932.802             car purchase
2         23341.752    purchase of the house
3         42820.568  supplementary education
4         25378.572        to have a wedding
...             ...                      ...
21520     35966.698     housing transactions
21521     24959.969        purchase of a car
21522     14347.610                 property
21523     39054.888        buying my own car
21524     13127.587             to buy a car

[21525 rows x 12 columns]

In [11]:
tabla = df.groupby(['income_type'])[['total_income','dob_years']].count()
tabla

                             total_income  dob_years
income_type
business                             5085       5085
civil servant                        1459       1459
employee                            11119      11119
entrepreneur                            2          2
paternity / maternity leave             1          1
retiree                              3856       3856
student                                 1          1
unemployed                              2          2